Merge branch 'main' of github.com:PatrikTrefil/mental-health-monitoring-platform into main
